In [1]:
import pandas as pd

# Test

In [2]:
pd.read_table('data/01.txt')

              email
0  jack@example.com
1  mary@example.com
2  lily@example.com
3   tom@example.com

In [5]:
pd.read_table("data/02.txt")

              name    age email
0  jack    18  jack@example.com
1  mary    19  mary@example.com
2  lily    17  lily@example.com
3       tom 17  tom@example.com
4       joe 20  joe@example.com

In [7]:
pd.read_table('data/03.txt', sep=':', header=None)

         0  1   2      3       4                5                  6
0     root  x   0      0    root            /root          /bin/bash
1   daemon  x   1      1  daemon        /usr/sbin  /usr/sbin/nologin
2      bin  x   2      2     bin             /bin  /usr/sbin/nologin
3      sys  x   3      3     sys             /dev  /usr/sbin/nologin
4     sync  x   4  65534    sync             /bin          /bin/sync
5    games  x   5     60   games       /usr/games  /usr/sbin/nologin
6      man  x   6     12     man   /var/cache/man  /usr/sbin/nologin
7       lp  x   7      7      lp   /var/spool/lpd  /usr/sbin/nologin
8     mail  x   8      8    mail        /var/mail  /usr/sbin/nologin
9     news  x   9      9    news  /var/spool/news  /usr/sbin/nologin
10    uucp  x  10     10    uucp  /var/spool/uucp  /usr/sbin/nologin
11   proxy  x  13     13   proxy             /bin  /usr/sbin/nologin

In [8]:
pd.read_table('data/03.txt', sep=':', names=['name','pwd','uid','gid','local','home','shell'])

      name pwd  uid    gid   local             home              shell
0     root   x    0      0    root            /root          /bin/bash
1   daemon   x    1      1  daemon        /usr/sbin  /usr/sbin/nologin
2      bin   x    2      2     bin             /bin  /usr/sbin/nologin
3      sys   x    3      3     sys             /dev  /usr/sbin/nologin
4     sync   x    4  65534    sync             /bin          /bin/sync
5    games   x    5     60   games       /usr/games  /usr/sbin/nologin
6      man   x    6     12     man   /var/cache/man  /usr/sbin/nologin
7       lp   x    7      7      lp   /var/spool/lpd  /usr/sbin/nologin
8     mail   x    8      8    mail        /var/mail  /usr/sbin/nologin
9     news   x    9      9    news  /var/spool/news  /usr/sbin/nologin
10    uucp   x   10     10    uucp  /var/spool/uucp  /usr/sbin/nologin
11   proxy   x   13     13   proxy             /bin  /usr/sbin/nologin

# CSV

pd.read_csv('data/04.csv')

# Excel

In [11]:
pd.read_excel('data/05.xlsx')

    电影名称       上映时间
0   神秘巨星 2018-09-01
1  移动迷宫3 2018-07-10
2    阿凡达 2018-12-21

# Html

In [14]:
tables = pd.read_html('data/06.html',header=0)

In [15]:
tables[0]

   排名  城市  工资
0  XX  XX  XX
1  XX  XX  XX

In [16]:
tables[1]

   aa  bb  cc
0  11  22  33
1  XX  XX  XX

In [17]:
tables = pd.read_html('data/06.html', header=0, attrs={'class':'mydata'})

In [18]:
len(tables)

1

In [20]:
tables[0]

   排名  城市  工资
0  XX  XX  XX
1  XX  XX  XX

# MySQL

In [22]:
import pymysql

In [24]:
conn = pymysql.connect(host='localhost',user='root',password='root',db='test',charset='utf8')

In [27]:
sql = 'select * from product'
data = pd.read_sql(sql,conn)
conn.close()

In [28]:
data

   Id    name
0   1     pan
1   2  pancil

# MongoDB

In [30]:
import pymongo

In [31]:
client = pymongo.MongoClient('localhost',27017)

In [32]:
client

MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True)

In [33]:
db = 'demo'
table = 'stu'
cursor = client[db][table].find()

In [34]:
data = pd.DataFrame(list(cursor))

In [35]:
data

                        _id   age      name sex
0  5b152f11f677e46fdd69cdfa  20.0  zhangsan   m
1  5b152f1ef677e46fdd69cdfb  22.0      lisi   w
2  5b153327f677e46fdd69cdfd  21.0        qq   m
3  5b153330f677e46fdd69cdfe  25.0        aa   m
4  5b153338f677e46fdd69cdff  20.0        bb   m
5  5b1533f1f677e46fdd69ce00  20.0        cc   m